WQH98/STM32_Project/Keil5/STM32F103C8T6/01_template/HARDWARE/w25q64/w25q64.h
#ifndef __W25Q64_H
#define __W25Q64_H

#include "stm32f1xx_hal.h"
#include "spi.h"

#define W25Q80 	0XEF13 	
#define W25Q16 	0XEF14
#define W25Q32 	0XEF15
#define W25Q64 	0XEF16
#define W25Q128	0XEF17
#define W25Q256 0XEF18

// 指令表
#define W25X_WriteEnable		0x06 
#define W25X_WriteDisable		0x04 
#define W25X_ReadStatusReg1		0x05 
#define W25X_ReadStatusReg2		0x35 
#define W25X_ReadStatusReg3		0x15 
#define W25X_WriteStatusReg1    0x01 
#define W25X_WriteStatusReg2    0x31 
#define W25X_WriteStatusReg3    0x11 
#define W25X_ReadData			0x03 
#define W25X_FastReadData		0x0B 
#define W25X_FastReadDual		0x3B 
#define W25X_PageProgram		0x02 
#define W25X_BlockErase			0xD8 
#define W25X_SectorErase		0x20 
#define W25X_ChipErase			0xC7 
#define W25X_PowerDown			0xB9 
#define W25X_ReleasePowerDown	0xAB 
#define W25X_DeviceID			0xAB 
#define W25X_ManufactDeviceID	0x90 
#define W25X_JedecDeviceID		0x9F 
#define W25X_Enable4ByteAddr    0xB7
#define W25X_Exit4ByteAddr      0xE9

void w25q64_init(void);
uint16_t w25qxx_read_id(void);
uint8_t w25qxx_read_sr(uint8_t regno);
void w25qxx_write_sr(uint8_t regno, uint8_t sr);
void w25qxx_write_enable(void);
void w25qxx_write_disable(void);
void w25qxx_read(uint8_t* pBuffer, uint32_t ReadAddr, uint16_t NumByteToRead);
void w25qxx_write_page(uint8_t* pBuffer, uint32_t WriteAddr, uint16_t NumByteToWrite);
void w25qxx_wait_busy(void);
void w25qxx_write_no_check(uint8_t* pBuffer, uint32_t WriteAddr, uint16_t NumByteToWrite);
void w25qxx_write(uint8_t* pBuffer, uint32_t WriteAddr, uint16_t NumByteToWrite);
void w25qxx_erase_chip(void);
void w25qxx_erase_sector(uint32_t dst_addr);
void w25qxx_power_down(void);
void w25qxx_wakeup(void);

#endif
